# Напишите программу, которая принимает на вход число N 
# и выдаёт последовательность из N членов.



# from random import randint

# n = int(input("введите число "))

# for numbers in range(n):
#     print (randint(-100, 100), end=" ")
